In [431]:
people = {
    'first': ['corey', 'jane', 'john'],
    'last': ['shaefer', 'doe', 'doe'],
    'email': ['rob@gmail.com', 'janegmail.com', 'john@gmail.com']
}

In [432]:
import pandas as pd

In [433]:
df = pd.DataFrame(people)

In [434]:
df

   first     last           email
0  corey  shaefer   rob@gmail.com
1   jane      doe   janegmail.com
2   john      doe  john@gmail.com

In [435]:
df['email']

0     rob@gmail.com
1     janegmail.com
2    john@gmail.com
Name: email, dtype: object

In [436]:
df.set_index('email', inplace=True)

In [437]:
df

                first     last
email
rob@gmail.com   corey  shaefer
janegmail.com    jane      doe
john@gmail.com   john      doe

# indexes

In [438]:
df.index

Index(['rob@gmail.com', 'janegmail.com', 'john@gmail.com'], dtype='object', name='email')

In [439]:
df.loc['janegmail.com', 'last']

'doe'

In [440]:
df.reset_index(inplace=True)
df.head()

            email  first     last
0   rob@gmail.com  corey  shaefer
1   janegmail.com   jane      doe
2  john@gmail.com   john      doe

In [441]:
filt = (df['last'] == 'shaefer') | (df['first'] == 'john')

In [442]:
df.loc[~filt, 'email']

1    janegmail.com
Name: email, dtype: object

In [443]:
df.columns

Index(['email', 'first', 'last'], dtype='object')

In [444]:
df.columns = ['email', 'first_name', 'last_name']
df.columns

Index(['email', 'first_name', 'last_name'], dtype='object')

In [445]:
df.columns = [x.lower() for x in df.columns]
df.columns

Index(['email', 'first_name', 'last_name'], dtype='object')

In [446]:
df

            email first_name last_name
0   rob@gmail.com      corey   shaefer
1   janegmail.com       jane       doe
2  john@gmail.com       john       doe

In [447]:
df.columns = df.columns.str.replace(' ', '_')
df.columns

Index(['email', 'first_name', 'last_name'], dtype='object')

In [448]:
df.rename(columns={
    'first_name': 'first',
    'last_name': 'last'
}, inplace=True)

In [449]:
df

            email  first     last
0   rob@gmail.com  corey  shaefer
1   janegmail.com   jane      doe
2  john@gmail.com   john      doe

In [450]:
df.loc[2, 'last'] = 'Havana'

In [451]:
df

            email  first     last
0   rob@gmail.com  corey  shaefer
1   janegmail.com   jane      doe
2  john@gmail.com   john   Havana

# filtering & updating rows/columns

In [452]:
filt = (df['email'] == 'john@gmail.com')

In [453]:
df.loc[filt, 'last'] = 'Smith'

In [454]:
df

            email  first     last
0   rob@gmail.com  corey  shaefer
1   janegmail.com   jane      doe
2  john@gmail.com   john    Smith

In [455]:
df['email'] = df['email'].str.lower()

In [456]:
df

            email  first     last
0   rob@gmail.com  corey  shaefer
1   janegmail.com   jane      doe
2  john@gmail.com   john    Smith

In [457]:
df['email'].apply(len)

0    13
1    13
2    14
Name: email, dtype: int64

In [458]:
def update_email(email):
    return(email.upper())

df['email'] = df['email'].apply(update_email)

In [459]:
df

            email  first     last
0   ROB@GMAIL.COM  corey  shaefer
1   JANEGMAIL.COM   jane      doe
2  JOHN@GMAIL.COM   john    Smith

In [460]:
df['email'] = df['email'].apply(lambda x: x.lower())

In [461]:
df

            email  first     last
0   rob@gmail.com  corey  shaefer
1   janegmail.com   jane      doe
2  john@gmail.com   john    Smith

In [462]:
df['email'].apply(len)

0    13
1    13
2    14
Name: email, dtype: int64

In [463]:
df.apply(len)

email    3
first    3
last     3
dtype: int64

In [464]:
df.apply(pd.Series.min)

email    janegmail.com
first            corey
last             Smith
dtype: object

In [465]:
df.apply(lambda x: x.min())

email    janegmail.com
first            corey
last             Smith
dtype: object

In [466]:
df.applymap(len)

   email  first  last
0     13      5     7
1     13      4     3
2     14      4     5

In [467]:
df.applymap(str.lower)

            email  first     last
0   rob@gmail.com  corey  shaefer
1   janegmail.com   jane      doe
2  john@gmail.com   john    smith

In [468]:
df

            email  first     last
0   rob@gmail.com  corey  shaefer
1   janegmail.com   jane      doe
2  john@gmail.com   john    Smith

In [469]:
df['first'].map({
    'corey': 'Chris',
    'jane': 'Mary'
})

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

In [470]:
df

            email  first     last
0   rob@gmail.com  corey  shaefer
1   janegmail.com   jane      doe
2  john@gmail.com   john    Smith

In [471]:
df['first'] = df['first'].replace({
    'corey': 'Chris',
    'jane': 'Mary'
})

In [472]:
df

            email  first     last
0   rob@gmail.com  Chris  shaefer
1   janegmail.com   Mary      doe
2  john@gmail.com   john    Smith

# add/remove rows & columns

In [473]:
df['first'] + ' ' + df['last']

0    Chris shaefer
1         Mary doe
2       john Smith
dtype: object

In [474]:
df['full_name'] = df['first'] + ' ' + df['last']
df

            email  first     last      full_name
0   rob@gmail.com  Chris  shaefer  Chris shaefer
1   janegmail.com   Mary      doe       Mary doe
2  john@gmail.com   john    Smith     john Smith

In [475]:
df.drop(columns=['first', 'last'], inplace=True)

In [476]:
df

            email      full_name
0   rob@gmail.com  Chris shaefer
1   janegmail.com       Mary doe
2  john@gmail.com     john Smith

In [477]:
df['full_name'].str.split(' ', expand=True)

       0        1
0  Chris  shaefer
1   Mary      doe
2   john    Smith

In [478]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [479]:
df

            email      full_name  first     last
0   rob@gmail.com  Chris shaefer  Chris  shaefer
1   janegmail.com       Mary doe   Mary      doe
2  john@gmail.com     john Smith   john    Smith

In [480]:
# create a new row to append to the DataFrame
new_row = pd.DataFrame({
    'first': ['Jane']
})

# append the new row to the original DataFrame
df = pd.concat([df, new_row], ignore_index=True)

df

            email      full_name  first     last
0   rob@gmail.com  Chris shaefer  Chris  shaefer
1   janegmail.com       Mary doe   Mary      doe
2  john@gmail.com     john Smith   john    Smith
3             NaN            NaN   Jane      NaN

In [482]:
people = {
    'first': ['Tony', 'Steve'],
    'last': ['Stark', 'Rogers'],
    'email': ['Tony@gmail.com', 'Steve@gmail.com'],
}
df2 = pd.DataFrame(people)
df2

   first    last            email
0   Tony   Stark   Tony@gmail.com
1  Steve  Rogers  Steve@gmail.com

In [483]:
df = pd.concat([df, df2], ignore_index=True)

In [484]:
df

             email      full_name  first     last
0    rob@gmail.com  Chris shaefer  Chris  shaefer
1    janegmail.com       Mary doe   Mary      doe
2   john@gmail.com     john Smith   john    Smith
3              NaN            NaN   Jane      NaN
4   Tony@gmail.com            NaN   Tony    Stark
5  Steve@gmail.com            NaN  Steve   Rogers

In [485]:
df.drop(index=4, inplace=True)
df

             email      full_name  first     last
0    rob@gmail.com  Chris shaefer  Chris  shaefer
1    janegmail.com       Mary doe   Mary      doe
2   john@gmail.com     john Smith   john    Smith
3              NaN            NaN   Jane      NaN
5  Steve@gmail.com            NaN  Steve   Rogers

In [486]:
filt = df['last'] == 'doe'
df.drop(index=df[filt].index, inplace=True)
df

             email      full_name  first     last
0    rob@gmail.com  Chris shaefer  Chris  shaefer
2   john@gmail.com     john Smith   john    Smith
3              NaN            NaN   Jane      NaN
5  Steve@gmail.com            NaN  Steve   Rogers

In [487]:
df

             email      full_name  first     last
0    rob@gmail.com  Chris shaefer  Chris  shaefer
2   john@gmail.com     john Smith   john    Smith
3              NaN            NaN   Jane      NaN
5  Steve@gmail.com            NaN  Steve   Rogers